Tekla Open API Reference for Tekla Structures 2025
AnalysisModelIssue.SeverityEnum Enumeration
 Issue severity.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum SeverityEnum
Public Enumeration SeverityEnum
Members
Member name | Value | Description
Error | 1 |  Error
Warning | 0 |  Warning
Information | 2 |  Information
See Also
Reference
Tekla.Structures.Analysis Namespace